In [2]:
import pandas as pd
pd.set_option('display.max_columns',10)
print("Original data:\n")
df=pd.read_excel("/Users/student/Downloads/studentperformance59.xlsx")
print(df)

Original data:

    S.NO  ROLL NO      NAME  ENGLISH  TAMIL  MATHS  SCIENCE  SOCIAL  TOTAL
0      1      106     Rishi     90.0   95.0   92.0     80.0    85.0  442.0
1      2      107       Anu     88.0   79.0   90.0     95.0    99.0  451.0
2      3      108      Pavi     75.0   90.0   89.0     90.0    92.0  436.0
3      4      109     Madhu     90.0   95.0   76.0     92.0    80.0  433.0
4      5      110    Harini     80.0   90.0   79.0     89.0    95.0  433.0
5      6      111      Gayu     90.0   80.0   85.0     99.0    98.0  452.0
6      7      112  Harshini     85.0   90.0   99.0     89.0    79.0  442.0
7      8      113      Kavi     89.0   90.0   96.0     91.0    83.0  449.0
8      9      114      Sumi     87.0   99.0   80.0     86.0    70.0  422.0
9     10      115       Sri     76.0   89.0   99.0     79.0    89.0  432.0
10    11      116  Darshini     83.0   94.0   95.0     76.0    98.0  446.0
11    12      117   Varshni     69.0   98.0   99.0     87.0    89.0  442.0
12    13      118    Gopika     89.0   90.0   99.0     95.0    97.0  470.0
13    14      119       NaN      NaN    NaN    NaN      NaN     NaN    NaN
14    15      120       Abi     79.0   89.0   90.0     99.0    98.0  455.0

In [3]:
f=df['NAME'].str.strip()
f.to_excel("studentperformance1.xlsx")
print(f)

0        Rishi
1          Anu
2         Pavi
3        Madhu
4       Harini
5         Gayu
6     Harshini
7         Kavi
8         Sumi
9          Sri
10    Darshini
11     Varshni
12      Gopika
13         NaN
14         Abi
Name: NAME, dtype: object

In [4]:
print("\nReplace value:")
k=df.fillna(method='pad')
print(k)
print("\n updated list \n")
k.to_excel("/Users/student/Downloads/studentperformance59.xlsx")

Replace value:
    S.NO  ROLL NO      NAME  ENGLISH  TAMIL  MATHS  SCIENCE  SOCIAL  TOTAL
0      1      106     Rishi     90.0   95.0   92.0     80.0    85.0  442.0
1      2      107       Anu     88.0   79.0   90.0     95.0    99.0  451.0
2      3      108      Pavi     75.0   90.0   89.0     90.0    92.0  436.0
3      4      109     Madhu     90.0   95.0   76.0     92.0    80.0  433.0
4      5      110    Harini     80.0   90.0   79.0     89.0    95.0  433.0
5      6      111      Gayu     90.0   80.0   85.0     99.0    98.0  452.0
6      7      112  Harshini     85.0   90.0   99.0     89.0    79.0  442.0
7      8      113      Kavi     89.0   90.0   96.0     91.0    83.0  449.0
8      9      114      Sumi     87.0   99.0   80.0     86.0    70.0  422.0
9     10      115       Sri     76.0   89.0   99.0     79.0    89.0  432.0
10    11      116  Darshini     83.0   94.0   95.0     76.0    98.0  446.0
11    12      117   Varshni     69.0   98.0   99.0     87.0    89.0  442.0
12    13      118    Gopika     89.0   90.0   99.0     95.0    97.0  470.0
13    14      119    Gopika     89.0   90.0   99.0     95.0    97.0  470.0
14    15      120       Abi     79.0   89.0   90.0     99.0    98.0  455.0

 updated list

In [5]:
print("\n Drop one particular column and its values:\n")
k.drop(['SOCIAL'],axis=1,inplace=True)
print(k)
print("\n updated list \n")
k.to_excel("/Users/student/Downloads/studentperformance59.xlsx")

 Drop one particular column and its values:

    S.NO  ROLL NO      NAME  ENGLISH  TAMIL  MATHS  SCIENCE  TOTAL
0      1      106     Rishi     90.0   95.0   92.0     80.0  442.0
1      2      107       Anu     88.0   79.0   90.0     95.0  451.0
2      3      108      Pavi     75.0   90.0   89.0     90.0  436.0
3      4      109     Madhu     90.0   95.0   76.0     92.0  433.0
4      5      110    Harini     80.0   90.0   79.0     89.0  433.0
5      6      111      Gayu     90.0   80.0   85.0     99.0  452.0
6      7      112  Harshini     85.0   90.0   99.0     89.0  442.0
7      8      113      Kavi     89.0   90.0   96.0     91.0  449.0
8      9      114      Sumi     87.0   99.0   80.0     86.0  422.0
9     10      115       Sri     76.0   89.0   99.0     79.0  432.0
10    11      116  Darshini     83.0   94.0   95.0     76.0  446.0
11    12      117   Varshni     69.0   98.0   99.0     87.0  442.0
12    13      118    Gopika     89.0   90.0   99.0     95.0  470.0
13    14      119    Gopika     89.0   90.0   99.0     95.0  470.0
14    15      120       Abi     79.0   89.0   90.0     99.0  455.0

 updated list

In [6]:
print("\nDrop NaN rows:\n")
df=pd.read_excel("/Users/student/Downloads/studentperformance59.xlsx")
print(df)
x=df.dropna()
print(x)
print("\n updated list:\n")
x.to_excel("/Users/student/Downloads/studentperformance59.xlsx")

Drop NaN rows:

    Unnamed: 0  S.NO  ROLL NO      NAME  ENGLISH  TAMIL  MATHS  SCIENCE  TOTAL
0            0     1      106     Rishi       90     95     92       80    442
1            1     2      107       Anu       88     79     90       95    451
2            2     3      108      Pavi       75     90     89       90    436
3            3     4      109     Madhu       90     95     76       92    433
4            4     5      110    Harini       80     90     79       89    433
5            5     6      111      Gayu       90     80     85       99    452
6            6     7      112  Harshini       85     90     99       89    442
7            7     8      113      Kavi       89     90     96       91    449
8            8     9      114      Sumi       87     99     80       86    422
9            9    10      115       Sri       76     89     99       79    432
10          10    11      116  Darshini       83     94     95       76    446
11          11    12      117   Varshni       69     98     99       87    442
12          12    13      118    Gopika       89     90     99       95    470
13          13    14      119    Gopika       89     90     99       95    470
14          14    15      120       Abi       79     89     90       99    455
    Unnamed: 0  S.NO  ROLL NO      NAME  ENGLISH  TAMIL  MATHS  SCIENCE  TOTAL
0            0     1      106     Rishi       90     95     92       80    442
1            1     2      107       Anu       88     79     90       95    451
2            2     3      108      Pavi       75     90     89       90    436
3            3     4      109     Madhu       90     95     76       92    433
4            4     5      110    Harini       80     90     79       89    433
5            5     6      111      Gayu       90     80     85       99    452
6            6     7      112  Harshini       85     90     99       89    442
7            7     8      113      Kavi       89     90     96       91    449
8            8     9      114      Sumi       87     99     80       86    422
9            9    10      115       Sri       76     89     99       79    432
10          10    11      116  Darshini       83     94     95       76    446
11          11    12      117   Varshni       69     98     99       87    442
12          12    13      118    Gopika       89     90     99       95    470
13          13    14      119    Gopika       89     90     99       95    470
14          14    15      120       Abi       79     89     90       99    455

 updated list:

In [7]:
#replacing values
print("\n Replace Values \n")
n=pd.read_excel("/Users/student/Downloads/studentperformance59.xlsx")
print("\n Original Data:\n")
print(n)
y=n.replace({89})
print("\n Replaced dataset:\n")
print(y)
print("\n updated dataset:\n")
y.to_excel("/Users/student/Downloads/studentperformance59.xlsx")

 Replace Values


 Original Data:

    Unnamed: 0.1  Unnamed: 0  S.NO  ROLL NO      NAME  ENGLISH  TAMIL  MATHS  \
0              0           0     1      106     Rishi       90     95     92
1              1           1     2      107       Anu       88     79     90
2              2           2     3      108      Pavi       75     90     89
3              3           3     4      109     Madhu       90     95     76
4              4           4     5      110    Harini       80     90     79
5              5           5     6      111      Gayu       90     80     85
6              6           6     7      112  Harshini       85     90     99
7              7           7     8      113      Kavi       89     90     96
8              8           8     9      114      Sumi       87     99     80
9              9           9    10      115       Sri       76     89     99
10            10          10    11      116  Darshini       83     94     95
11            11          11    12      117   Varshni       69     98     99
12            12          12    13      118    Gopika       89     90     99
13            13          13    14      119    Gopika       89     90     99
14            14          14    15      120       Abi       79     89     90

    SCIENCE  TOTAL
0        80    442
1        95    451
2        90    436
3        92    433
4        89    433
5        99    452
6        89    442
7        91    449
8        86    422
9        79    432
10       76    446
11       87    442
12       95    470
13       95    470
14       99    455

 Replaced dataset:

    Unnamed: 0.1  Unnamed: 0  S.NO  ROLL NO      NAME  ENGLISH  TAMIL  MATHS  \
0              0           0     1      106     Rishi       90     95     92
1              1           1     2      107       Anu       88     79     90
2              2           2     3      108      Pavi       75     90     89
3              3           3     4      109     Madhu       90     95     76
4              4           4     5      110    Harini       80     90     79
5              5           5     6      111      Gayu       90     80     85
6              6           6     7      112  Harshini       85     90     99
7              7           7     8      113      Kavi       89     90     96
8              8           8     9      114      Sumi       87     99     80
9              9           9    10      115       Sri       76     89     99
10            10          10    11      116  Darshini       83     94     95
11            11          11    12      117   Varshni       69     98     99
12            12          12    13      118    Gopika       89     90     99
13            13          13    14      119    Gopika       89     90     99
14            14          14    15      120       Abi       79     89     90

    SCIENCE  TOTAL
0        80    442
1        95    451
2        90    436
3        92    433
4        89    433
5        99    452
6        89    442
7        91    449
8        86    422
9        79    432
10       76    446
11       87    442
12       95    470
13       95    470
14       99    455

 updated dataset:

In [8]:
df=pd.read_excel("/Users/student/Downloads/studentperformance59.xlsx")
print(df)
print("\nExtract using isin()function:\n")
new=df["ENGLISH"].isin([76])
print(df[new])

    Unnamed: 0.2  Unnamed: 0.1  Unnamed: 0  S.NO  ROLL NO  ... ENGLISH  TAMIL  \
0              0             0           0     1      106  ...      90     95
1              1             1           1     2      107  ...      88     79
2              2             2           2     3      108  ...      75     90
3              3             3           3     4      109  ...      90     95
4              4             4           4     5      110  ...      80     90
5              5             5           5     6      111  ...      90     80
6              6             6           6     7      112  ...      85     90
7              7             7           7     8      113  ...      89     90
8              8             8           8     9      114  ...      87     99
9              9             9           9    10      115  ...      76     89
10            10            10          10    11      116  ...      83     94
11            11            11          11    12      117  ...      69     98
12            12            12          12    13      118  ...      89     90
13            13            13          13    14      119  ...      89     90
14            14            14          14    15      120  ...      79     89

    MATHS  SCIENCE  TOTAL
0      92       80    442
1      90       95    451
2      89       90    436
3      76       92    433
4      79       89    433
5      85       99    452
6      99       89    442
7      96       91    449
8      80       86    422
9      99       79    432
10     95       76    446
11     99       87    442
12     99       95    470
13     99       95    470
14     90       99    455

[15 rows x 11 columns]

Extract using isin()function:

   Unnamed: 0.2  Unnamed: 0.1  Unnamed: 0  S.NO  ROLL NO  ... ENGLISH  TAMIL  \
9             9             9           9    10      115  ...      76     89

   MATHS  SCIENCE  TOTAL
9     99       79    432

[1 rows x 11 columns]